---
kind: type
id: T:Autodesk.Revit.DB.Electrical.DistributionSysTypeSetIterator
source: html/40c37b27-1807-9a2b-33a6-ab77a30bcbac.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSetIterator

An iterator to a DistributionSys type set.

## Syntax (C#)
```csharp
public abstract class DistributionSysTypeSetIterator : APIObject,
	IEnumerator
```